In [1]:
import pandas as pd
import numpy as np
import seaborn as sn
import matplotlib as mpl
import matplotlib.pyplot as plt
%matplotlib inline
import warnings
warnings.filterwarnings('ignore')

In [2]:
df1 = pd.read_csv('Data/Placement_Data_Full_Class.csv')

In [3]:
df = df1.copy(deep=True)

In [4]:
df.head()

,sl_no,gender,ssc_p,ssc_b,hsc_p,hsc_b,hsc_s,degree_p,degree_t,workex,etest_p,specialisation,mba_p,status,salary
0,1,M,67.00,Others,91.00,Others,Commerce,58.00,Sci&Tech,No,55.0,Mkt&HR,58.80,Placed,270000.0
1,2,M,79.33,Central,78.33,Others,Science,77.48,Sci&Tech,Yes,86.5,Mkt&Fin,66.28,Placed,200000.0
2,3,M,65.00,Central,68.00,Central,Arts,64.00,Comm&Mgmt,No,75.0,Mkt&Fin,57.80,Placed,250000.0
3,4,M,56.00,Central,52.00,Central,Science,52.00,Sci&Tech,No,66.0,Mkt&HR,59.43,Not Placed,NaN
4,5,M,85.80,Central,73.60,Central,Commerce,73.30,Comm&Mgmt,No,96.8,Mkt&Fin,55.50,Placed,425000.0

In [5]:
df.shape

(215, 15)

## Data Information

ðŸ‘‰ sl_no: Serial Number<br>
ðŸ‘‰ gender: Gender- Male='M',Female='F' <br>
ðŸ‘‰ ssc_p: Secondary Education percentage- 10th Grade <br>
ðŸ‘‰ ssc_b: Board of Education- Central/ Others <br>
ðŸ‘‰ hsc_p: Higher Secondary Education percentage- 12th Grade <br>
ðŸ‘‰ hsc_b: Board of Education- Central/ Others <br>
ðŸ‘‰ hsc_s: Specialization in Higher Secondary Education <br>
ðŸ‘‰ degree_p: Degree Percentage <br>
ðŸ‘‰ degree_t: Under-Graduation(Degree type)- Field of degree education <br>
ðŸ‘‰ workex: Work Experience <br>
ðŸ‘‰ etest_p: Employability test percentage ( conducted by the college) <br>
ðŸ‘‰ specialisation: Post Graduation(MBA)- Specialization <br>
ðŸ‘‰ mba_p: MBA percentage <br>
ðŸ‘‰ status: Status of placement- Placed/Not placed <br>
ðŸ‘‰ salary: Salary offered by corporate to candidates <br>

In [6]:
df.isna().sum()

sl_no              0
gender             0
ssc_p              0
ssc_b              0
hsc_p              0
hsc_b              0
hsc_s              0
degree_p           0
degree_t           0
workex             0
etest_p            0
specialisation     0
mba_p              0
status             0
salary            67
dtype: int64

In [7]:
df.duplicated().sum()

0

In [8]:
# Check Null and Dtypes
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 215 entries, 0 to 214
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   sl_no           215 non-null    int64
 1   gender          215 non-null    object
 2   ssc_p           215 non-null    float64
 3   ssc_b           215 non-null    object
 4   hsc_p           215 non-null    float64
 5   hsc_b           215 non-null    object
 6   hsc_s           215 non-null    object
 7   degree_p        215 non-null    float64
 8   degree_t        215 non-null    object
 9   workex          215 non-null    object
 10  etest_p         215 non-null    float64
 11  specialisation  215 non-null    object
 12  mba_p           215 non-null    float64
 13  status          215 non-null    object
 14  salary          148 non-null    float64
dtypes: float64(6), int64(1), object(8)
memory usage: 25.3+ KB

In [9]:
df.nunique()

sl_no             215
gender              2
ssc_p             103
ssc_b               2
hsc_p              97
hsc_b               2
hsc_s               3
degree_p           89
degree_t            3
workex              2
etest_p           100
specialisation      2
mba_p             205
status              2
salary             45
dtype: int64

In [10]:
df.describe()

,sl_no,ssc_p,hsc_p,degree_p,etest_p,mba_p,salary
count,215.000000,215.000000,215.000000,215.000000,215.000000,215.000000,148.000000
mean,108.000000,67.303395,66.333163,66.370186,72.100558,62.278186,288655.405405
std,62.209324,10.827205,10.897509,7.358743,13.275956,5.833385,93457.452420
min,1.000000,40.890000,37.000000,50.000000,50.000000,51.210000,200000.000000
25%,54.500000,60.600000,60.900000,61.000000,60.000000,57.945000,240000.000000
50%,108.000000,67.000000,65.000000,66.000000,71.000000,62.000000,265000.000000
75%,161.500000,75.700000,73.000000,72.000000,83.500000,66.255000,300000.000000
max,215.000000,89.400000,97.700000,91.000000,98.000000,77.890000,940000.000000

In [11]:
df.head()

,sl_no,gender,ssc_p,ssc_b,hsc_p,hsc_b,hsc_s,degree_p,degree_t,workex,etest_p,specialisation,mba_p,status,salary
0,1,M,67.00,Others,91.00,Others,Commerce,58.00,Sci&Tech,No,55.0,Mkt&HR,58.80,Placed,270000.0
1,2,M,79.33,Central,78.33,Others,Science,77.48,Sci&Tech,Yes,86.5,Mkt&Fin,66.28,Placed,200000.0
2,3,M,65.00,Central,68.00,Central,Arts,64.00,Comm&Mgmt,No,75.0,Mkt&Fin,57.80,Placed,250000.0
3,4,M,56.00,Central,52.00,Central,Science,52.00,Sci&Tech,No,66.0,Mkt&HR,59.43,Not Placed,NaN
4,5,M,85.80,Central,73.60,Central,Commerce,73.30,Comm&Mgmt,No,96.8,Mkt&Fin,55.50,Placed,425000.0

In [15]:
print("Categories in 'gender' variable:             ",end=" " )
print(df['gender'].unique())

print("Categories in 'ssc_b' variable:              ",end=" ")
print(df['ssc_b'].unique())

print("Categories in'hsc_b' variable:               ",end=" " )
print(df['hsc_b'].unique())

print("Categories in 'hsc_s' variable:              ",end=" " )
print(df['hsc_s'].unique())

print("Categories in 'degree_t' variable:           ",end=" " )
print(df['degree_t'].unique())

print("Categories in 'workex' variable:             ",end=" " )
print(df['workex'].unique())

print("Categories in 'specialisation' variable:     ",end=" " )
print(df['degree_t'].unique())

print("Categories in 'status' variable:             ",end=" " )
print(df['status'].unique())

Categories in 'gender' variable:              ['M' 'F']
Categories in 'ssc_b' variable:               ['Others' 'Central']
Categories in'hsc_b' variable:                ['Others' 'Central']
Categories in 'hsc_s' variable:               ['Commerce' 'Science' 'Arts']
Categories in 'degree_t' variable:            ['Sci&Tech' 'Comm&Mgmt' 'Others']
Categories in 'workex' variable:              ['No' 'Yes']
Categories in 'specialisation' variable:      ['Sci&Tech' 'Comm&Mgmt' 'Others']
Categories in 'status' variable:              ['Placed' 'Not Placed']

In [19]:
# define numerical & categorical columns
numeric_features = [feature for feature in df.columns if df[feature].dtype != 'O']
categorical_features = [feature for feature in df.columns if df[feature].dtype == 'O']

# print columns
print('We have {} numerical features     : {}'.format(len(numeric_features), numeric_features))
print('\nWe have {} categorical features   : {}'.format(len(categorical_features), categorical_features))

We have 7 numerical features     : ['sl_no', 'ssc_p', 'hsc_p', 'degree_p', 'etest_p', 'mba_p', 'salary']

We have 8 categorical features   : ['gender', 'ssc_b', 'hsc_b', 'hsc_s', 'degree_t', 'workex', 'specialisation', 'status']